score = 0  #тут скоко на начале балов

#намбер 1
q1 = input('Головні герої в Gta 5 (один з них)\n')
if q1.lower() == "майкл":
    print('Правильно + очко!')
    score += 1
else:
    print('Неправильно🤬 дубіна')

#намбер 2
q2 = input('Головні герої в Gta 5 (ще один)\n')
if q2.lower() == "тревор":
    print('Правильно + очко!')
    score += 1
else:
    print('Неправильно🤬 дубіна')

#намбер 3
q3 = input('Головні герої в Gta 5 (третій)\n')
if q3.lower() == "франклин":
    print('Правильно + очко!')
    score += 1
else:
    print('Неправильно🤬 дубіна')

#Щя вот добавлю ище вопросы
q4 = input('Скільки зірок розшуку максимум у GTA 5?\n')
if q4 == "5":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q5 = input('Яке авто з GTA 5 схоже на Lamborghini?\n')
if q5.lower() == "пегасі":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q6 = input('Яке місто є прототипом для Los Santos у GTA 5?\n')
if q6.lower() == "лос-анджелес":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q7 = input('Як звати собаку Франклина?\n')
if q7.lower() == "чоп":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q8 = input('Чи можна в GTA 5 грати в теніс?\n(так/ні)\n')
if q8.lower() == "так":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q9 = input('Як називається онлайн-режим GTA 5?\n')
if q9.lower() == "gta online":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна")

q10 = input('На якому острові розташований Los Santos?\n')
if q10.lower() == "сан-андреас":
    print("Правильно + очко!")
    score += 1
else:
    print("Неправильно🤬 дубіна Ну ти і тупий...")

#Такс конец
print(f"\nТвій результат: {score} з 10 очок.")
