#Щяс будем думать название
print("Виживи або вмри😈"
      "Автор:Fox_ua")
print("""Лор сторії:
Ви появилися в лісі і не можете згадати чтого ви тут робите.
Легенди кажуть що там існує страшний монстр Хаги Ваги.
Ваша задача вибратися живими і вибратися з лісу.
Удачі!""")
print('Ти пішов шукати вихід і наткнувся на розвилку \n')
print('1: Піти наліво')
print('2: Піти направо')

vopros1 = input('Куда ти підеш?(1 або 2): ')
if vopros1 == "1":
    print('О ні ти зустрів Хаги Ваги і він тебе скушав🤤 Game over☠️')
elif vopros1 == "2":
    print('Ти найшов зброю тепер ти зможеш відбиватися')
print('Після того як ти найшов зброю ти думав що зробити \n')
print('1: Оборонятися')
print('2: Піти додому')

vopros2 = input('Ти підеш додому чи будеш оборонятися?(1 або 2): ')
if vopros2 == "1":
        print('Ти пішов оборонятися і ти ранив Хаги Ваги і він втік')
elif vopros2 == "2":
        print('О ні тебе Хаги Ваги вбив так як він тебе ждав біля дому Game Over☠️')
print('Ти відбив монстра але так як ти найшов зброю бог рішив що в тебе пару патронів')
print('1: Піти в селище шукати патрони')
print('2: Піти туди де втік Хаги Ваги')

vopros3 = input('Що робити?(1 або 2) \n')
if vopros3 == "1":
            print('Ти пішов в селище і найшов патрони')
elif vopros3 == "2":
            print('Ти пішов туди де пішов Хаги Ваги но він тебе зловив і скушав🤤 Game Over☠️')